Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL1.h
/*! @name PSCCTL1 - VDD1_SENSE Peripheral Clock Control 1 */
/*! @{ */

#define CLKCTL1_PSCCTL1_SENSE_ACCESS_RAM_ARBITER0_MASK (0x1U)
#define CLKCTL1_PSCCTL1_SENSE_ACCESS_RAM_ARBITER0_SHIFT (0U)
/*! SENSE_ACCESS_RAM_ARBITER0 - VDD1_SENSE Access RAM Arbiter0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SENSE_ACCESS_RAM_ARBITER0(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SENSE_ACCESS_RAM_ARBITER0_SHIFT)) & CLKCTL1_PSCCTL1_SENSE_ACCESS_RAM_ARBITER0_MASK)

#define CLKCTL1_PSCCTL1_HIFI1_MASK               (0x2U)
#define CLKCTL1_PSCCTL1_HIFI1_SHIFT              (1U)
/*! HiFi1 - HiFi1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_HIFI1(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_HIFI1_SHIFT)) & CLKCTL1_PSCCTL1_HIFI1_MASK)

#define CLKCTL1_PSCCTL1_EDMA2_MASK               (0x10U)
#define CLKCTL1_PSCCTL1_EDMA2_SHIFT              (4U)
/*! eDMA2 - eDMA2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_EDMA2(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_EDMA2_SHIFT)) & CLKCTL1_PSCCTL1_EDMA2_MASK)

#define CLKCTL1_PSCCTL1_EDMA3_MASK               (0x20U)
#define CLKCTL1_PSCCTL1_EDMA3_SHIFT              (5U)
/*! eDMA3 - eDMA3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_EDMA3(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_EDMA3_SHIFT)) & CLKCTL1_PSCCTL1_EDMA3_MASK)

#define CLKCTL1_PSCCTL1_LP_FLEXCOMM17_MASK       (0x40U)
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM17_SHIFT      (6U)
/*! LP_FLEXCOMM17 - LP_FLEXCOMM17 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM17(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_LP_FLEXCOMM17_SHIFT)) & CLKCTL1_PSCCTL1_LP_FLEXCOMM17_MASK)

#define CLKCTL1_PSCCTL1_LP_FLEXCOMM18_MASK       (0x80U)
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM18_SHIFT      (7U)
/*! LP_FLEXCOMM18 - LP_FLEXCOMM18 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM18(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_LP_FLEXCOMM18_SHIFT)) & CLKCTL1_PSCCTL1_LP_FLEXCOMM18_MASK)

#define CLKCTL1_PSCCTL1_LP_FLEXCOMM19_MASK       (0x100U)
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM19_SHIFT      (8U)
/*! LP_FLEXCOMM19 - LP_FLEXCOMM19 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM19(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_LP_FLEXCOMM19_SHIFT)) & CLKCTL1_PSCCTL1_LP_FLEXCOMM19_MASK)

#define CLKCTL1_PSCCTL1_LP_FLEXCOMM20_MASK       (0x200U)
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM20_SHIFT      (9U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_LP_FLEXCOMM20(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_LP_FLEXCOMM20_SHIFT)) & CLKCTL1_PSCCTL1_LP_FLEXCOMM20_MASK)

#define CLKCTL1_PSCCTL1_SAI3_MASK                (0x400U)
#define CLKCTL1_PSCCTL1_SAI3_SHIFT               (10U)
/*! SAI3 - SAI3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SAI3(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SAI3_SHIFT)) & CLKCTL1_PSCCTL1_SAI3_MASK)

#define CLKCTL1_PSCCTL1_I3C2_MASK                (0x800U)
#define CLKCTL1_PSCCTL1_I3C2_SHIFT               (11U)
/*! I3C2 - I3C2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_I3C2(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_I3C2_SHIFT)) & CLKCTL1_PSCCTL1_I3C2_MASK)

#define CLKCTL1_PSCCTL1_I3C3_MASK                (0x1000U)
#define CLKCTL1_PSCCTL1_I3C3_SHIFT               (12U)
/*! I3C3 - I3C3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_I3C3(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_I3C3_SHIFT)) & CLKCTL1_PSCCTL1_I3C3_MASK)

#define CLKCTL1_PSCCTL1_GPIO8_MASK               (0x2000U)
#define CLKCTL1_PSCCTL1_GPIO8_SHIFT              (13U)
/*! GPIO8 - GPIO8 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_GPIO8(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_GPIO8_SHIFT)) & CLKCTL1_PSCCTL1_GPIO8_MASK)

#define CLKCTL1_PSCCTL1_GPIO9_MASK               (0x4000U)
#define CLKCTL1_PSCCTL1_GPIO9_SHIFT              (14U)
/*! GPIO9 - GPIO9 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_GPIO9(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_GPIO9_SHIFT)) & CLKCTL1_PSCCTL1_GPIO9_MASK)

#define CLKCTL1_PSCCTL1_GPIO10_MASK              (0x8000U)
#define CLKCTL1_PSCCTL1_GPIO10_SHIFT             (15U)
/*! GPIO10 - GPIO10 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_GPIO10(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_GPIO10_SHIFT)) & CLKCTL1_PSCCTL1_GPIO10_MASK)

#define CLKCTL1_PSCCTL1_PINT1_MASK               (0x10000U)
#define CLKCTL1_PSCCTL1_PINT1_SHIFT              (16U)
/*! PINT1 - PINT1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_PINT1(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_PINT1_SHIFT)) & CLKCTL1_PSCCTL1_PINT1_MASK)

#define CLKCTL1_PSCCTL1_CTIMER5_MASK             (0x20000U)
#define CLKCTL1_PSCCTL1_CTIMER5_SHIFT            (17U)
/*! CTIMER5 - CTIMER5 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_CTIMER5(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CTIMER5_SHIFT)) & CLKCTL1_PSCCTL1_CTIMER5_MASK)

#define CLKCTL1_PSCCTL1_CTIMER6_MASK             (0x40000U)
#define CLKCTL1_PSCCTL1_CTIMER6_SHIFT            (18U)
/*! CTIMER6 - CTIMER6 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_CTIMER6(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CTIMER6_SHIFT)) & CLKCTL1_PSCCTL1_CTIMER6_MASK)

#define CLKCTL1_PSCCTL1_CTIMER7_MASK             (0x80000U)
#define CLKCTL1_PSCCTL1_CTIMER7_SHIFT            (19U)
/*! CTIMER7 - CTIMER7 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_CTIMER7(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CTIMER7_SHIFT)) & CLKCTL1_PSCCTL1_CTIMER7_MASK)

#define CLKCTL1_PSCCTL1_MRT1_MASK                (0x100000U)
#define CLKCTL1_PSCCTL1_MRT1_SHIFT               (20U)
/*! MRT1 - MRT1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_MRT1(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_MRT1_SHIFT)) & CLKCTL1_PSCCTL1_MRT1_MASK)

#define CLKCTL1_PSCCTL1_UTICK1_MASK              (0x200000U)
#define CLKCTL1_PSCCTL1_UTICK1_SHIFT             (21U)
/*! UTICK1 - UTICK1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_UTICK1(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_UTICK1_SHIFT)) & CLKCTL1_PSCCTL1_UTICK1_MASK)

#define CLKCTL1_PSCCTL1_CDOG3_MASK               (0x400000U)
#define CLKCTL1_PSCCTL1_CDOG3_SHIFT              (22U)
/*! CDOG3 - CDOG3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_CDOG3(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CDOG3_SHIFT)) & CLKCTL1_PSCCTL1_CDOG3_MASK)

