Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL1.h
#define CLKCTL1_PSCCTL1_SET_I3C3_MASK            (0x1000U)
#define CLKCTL1_PSCCTL1_SET_I3C3_SHIFT           (12U)
/*! I3C3 - I3C3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_I3C3(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_I3C3_SHIFT)) & CLKCTL1_PSCCTL1_SET_I3C3_MASK)

#define CLKCTL1_PSCCTL1_SET_GPIO8_MASK           (0x2000U)
#define CLKCTL1_PSCCTL1_SET_GPIO8_SHIFT          (13U)
/*! GPIO8 - GPIO8 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_GPIO8(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_GPIO8_SHIFT)) & CLKCTL1_PSCCTL1_SET_GPIO8_MASK)

#define CLKCTL1_PSCCTL1_SET_GPIO9_MASK           (0x4000U)
#define CLKCTL1_PSCCTL1_SET_GPIO9_SHIFT          (14U)
/*! GPIO9 - GPIO9 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_GPIO9(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_GPIO9_SHIFT)) & CLKCTL1_PSCCTL1_SET_GPIO9_MASK)

#define CLKCTL1_PSCCTL1_SET_GPIO10_MASK          (0x8000U)
#define CLKCTL1_PSCCTL1_SET_GPIO10_SHIFT         (15U)
/*! GPIO10 - GPIO10 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_GPIO10(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_GPIO10_SHIFT)) & CLKCTL1_PSCCTL1_SET_GPIO10_MASK)

#define CLKCTL1_PSCCTL1_SET_PINT1_MASK           (0x10000U)
#define CLKCTL1_PSCCTL1_SET_PINT1_SHIFT          (16U)
/*! PINT1 - PINT1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_PINT1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_PINT1_SHIFT)) & CLKCTL1_PSCCTL1_SET_PINT1_MASK)

#define CLKCTL1_PSCCTL1_SET_CTIMER5_MASK         (0x20000U)
#define CLKCTL1_PSCCTL1_SET_CTIMER5_SHIFT        (17U)
/*! CTIMER5 - CTIMER5 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_CTIMER5(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_CTIMER5_SHIFT)) & CLKCTL1_PSCCTL1_SET_CTIMER5_MASK)

#define CLKCTL1_PSCCTL1_SET_CTIMER6_MASK         (0x40000U)
#define CLKCTL1_PSCCTL1_SET_CTIMER6_SHIFT        (18U)
/*! CTIMER6 - CTIMER6 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_CTIMER6(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_CTIMER6_SHIFT)) & CLKCTL1_PSCCTL1_SET_CTIMER6_MASK)

#define CLKCTL1_PSCCTL1_SET_CTIMER7_MASK         (0x80000U)
#define CLKCTL1_PSCCTL1_SET_CTIMER7_SHIFT        (19U)
/*! CTIMER7 - CTIMER7 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_CTIMER7(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_CTIMER7_SHIFT)) & CLKCTL1_PSCCTL1_SET_CTIMER7_MASK)

#define CLKCTL1_PSCCTL1_SET_MRT1_MASK            (0x100000U)
#define CLKCTL1_PSCCTL1_SET_MRT1_SHIFT           (20U)
/*! MRT1 - MRT1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_MRT1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_MRT1_SHIFT)) & CLKCTL1_PSCCTL1_SET_MRT1_MASK)

#define CLKCTL1_PSCCTL1_SET_UTICK1_MASK          (0x200000U)
#define CLKCTL1_PSCCTL1_SET_UTICK1_SHIFT         (21U)
/*! UTICK1 - UTICK1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_UTICK1(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_UTICK1_SHIFT)) & CLKCTL1_PSCCTL1_SET_UTICK1_MASK)

#define CLKCTL1_PSCCTL1_SET_CDOG3_MASK           (0x400000U)
#define CLKCTL1_PSCCTL1_SET_CDOG3_SHIFT          (22U)
/*! CDOG3 - CDOG3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_CDOG3(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_CDOG3_SHIFT)) & CLKCTL1_PSCCTL1_SET_CDOG3_MASK)

#define CLKCTL1_PSCCTL1_SET_CDOG4_MASK           (0x800000U)
#define CLKCTL1_PSCCTL1_SET_CDOG4_SHIFT          (23U)
/*! CDOG4 - CDOG4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_CDOG4(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_CDOG4_SHIFT)) & CLKCTL1_PSCCTL1_SET_CDOG4_MASK)

#define CLKCTL1_PSCCTL1_SET_MU3_MASK             (0x1000000U)
#define CLKCTL1_PSCCTL1_SET_MU3_SHIFT            (24U)
/*! MU3 - MU3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_MU3(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_MU3_SHIFT)) & CLKCTL1_PSCCTL1_SET_MU3_MASK)

#define CLKCTL1_PSCCTL1_SET_SEMA42_3_MASK        (0x2000000U)
#define CLKCTL1_PSCCTL1_SET_SEMA42_3_SHIFT       (25U)
/*! SEMA42_3 - SEMA42_3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_SEMA42_3(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_SEMA42_3_SHIFT)) & CLKCTL1_PSCCTL1_SET_SEMA42_3_MASK)

#define CLKCTL1_PSCCTL1_SET_WWDT2_MASK           (0x4000000U)
#define CLKCTL1_PSCCTL1_SET_WWDT2_SHIFT          (26U)
/*! WWDT2 - WWDT2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_WWDT2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_WWDT2_SHIFT)) & CLKCTL1_PSCCTL1_SET_WWDT2_MASK)

#define CLKCTL1_PSCCTL1_SET_WWDT3_MASK           (0x8000000U)
#define CLKCTL1_PSCCTL1_SET_WWDT3_SHIFT          (27U)
/*! WWDT3 - WWDT3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_WWDT3(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_WWDT3_SHIFT)) & CLKCTL1_PSCCTL1_SET_WWDT3_MASK)

#define CLKCTL1_PSCCTL1_SET_PVTS1_MASK           (0x10000000U)
#define CLKCTL1_PSCCTL1_SET_PVTS1_SHIFT          (28U)
/*! PVTS1 - PVTS1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_PVTS1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_PVTS1_SHIFT)) & CLKCTL1_PSCCTL1_SET_PVTS1_MASK)

#define CLKCTL1_PSCCTL1_SET_INPUTMUX1_MASK       (0x40000000U)
#define CLKCTL1_PSCCTL1_SET_INPUTMUX1_SHIFT      (30U)
/*! INPUTMUX1 - INPUTMUX1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_INPUTMUX1(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_INPUTMUX1_SHIFT)) & CLKCTL1_PSCCTL1_SET_INPUTMUX1_MASK)
/*! @} */

/*! @name PSCCTL0_CLR - VDD1_SENSE Peripheral Clock Control 0 Clear */
/*! @{ */

