Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_CLKCTL1.h
/* The count of CLKCTL1_FCFCLKSEL */
#define CLKCTL1_FCFCLKSEL_COUNT                  (4U)

/*! @name FCFCLKDIV - LP_FLEXCOMM17 Clock Divider..LP_FLEXCOMM20 Clock Divider */
/*! @{ */

#define CLKCTL1_FCFCLKDIV_DIV_MASK               (0xFFU)
#define CLKCTL1_FCFCLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL1_FCFCLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_DIV_SHIFT)) & CLKCTL1_FCFCLKDIV_DIV_MASK)

#define CLKCTL1_FCFCLKDIV_BUSY_MASK              (0x10000000U)
#define CLKCTL1_FCFCLKDIV_BUSY_SHIFT             (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_FCFCLKDIV_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_BUSY_SHIFT)) & CLKCTL1_FCFCLKDIV_BUSY_MASK)

#define CLKCTL1_FCFCLKDIV_RESET_MASK             (0x20000000U)
#define CLKCTL1_FCFCLKDIV_RESET_SHIFT            (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_FCFCLKDIV_RESET(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_RESET_SHIFT)) & CLKCTL1_FCFCLKDIV_RESET_MASK)

#define CLKCTL1_FCFCLKDIV_HALT_MASK              (0x40000000U)
#define CLKCTL1_FCFCLKDIV_HALT_SHIFT             (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_FCFCLKDIV_HALT(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_HALT_SHIFT)) & CLKCTL1_FCFCLKDIV_HALT_MASK)

#define CLKCTL1_FCFCLKDIV_REQFLAG_MASK           (0x80000000U)
#define CLKCTL1_FCFCLKDIV_REQFLAG_SHIFT          (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished
 *  0b1..A change is being made to the divider value
 */
#define CLKCTL1_FCFCLKDIV_REQFLAG(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_FCFCLKDIV_REQFLAG_MASK)
/*! @} */

/* The count of CLKCTL1_FCFCLKDIV */
#define CLKCTL1_FCFCLKDIV_COUNT                  (4U)

/*! @name AUDIOVDD1CLKSEL - VDD1_SENSE Audio Clock Source */
/*! @{ */

#define CLKCTL1_AUDIOVDD1CLKSEL_SEL_MASK         (0x3U)
#define CLKCTL1_AUDIOVDD1CLKSEL_SEL_SHIFT        (0U)
/*! SEL - Clock Source Select
 *  0b00..mclk_in
 *  0b01..osc_clk
 *  0b10..fro2_div8
 *  0b11..audio_pll_pfd3
 */
#define CLKCTL1_AUDIOVDD1CLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOVDD1CLKSEL_SEL_SHIFT)) & CLKCTL1_AUDIOVDD1CLKSEL_SEL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CLKCTL1_Register_Masks */


/*!
 * @}
 */ /* end of group CLKCTL1_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_CLKCTL1_H_ */

